espressif/esp-idf/tools/test_apps/linux_compatible/mock_build_test/sdkconfig.defaults
CONFIG_IDF_TARGET="linux"

CONFIG_I2C_SUPPRESS_DEPRECATE_WARN=y
